adventuresintechland.org
#+TODO: TODO(t) FIX(f) CODE(c) CHECK(e) | DONE(d!)
#+OPTIONS: num:0
#+TITLE: My adventures in tech land - TODO file
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./adventuresintechland.org.css" /> 
#+HTML_LINK_HOME:  ./index.html
#+HTML_LINK_UP: ..

----------
* TODO daily entries
  DEADLINE: <2019-11-30 Sat ++1d>
  :PROPERTIES:
  :LAST_REPEAT: [2019-11-29 Fri 20:26]
  :END:
  - State "DONE"       from "TODO"       [2019-11-29 Fri 20:26]
** create the folder for that day                                    :finder:
** run =adventuresintechland_old.el= (for now) to create the template :emacs:
** fill the template with the stuff I did                                :me:
** edit the main index:                                                  :me:
*** [last day] x 2
*** logbook + nb of documented days
** create the rss entry in adventuresintechland.xml                      :me:
** commit everything                                                    :git:
*** git checkout "gh-pages"
*** git status
*** git add *
*** git commit -m "commit message"
*** git push origin
*** git checkout "master"
*** git merge gh-pages
*** git push origin
*** git checkout "gh-pages"

* code
** FIX (19/12/01) just got bitten by the date edge cases...           :elisp:
** FIX (19/11/29) the RSS feed does not work anymore                    :xml:
** CODE (19/11/26) create daily folder structure and html template    :elisp:
** CODE (18/11/18) automated index creation for readings              :shell:
** CODE (18/11/18) Automate CSS index generation                      :shell:
The index.sh script exists but needs to be run automatically.
** CODE (18/11/13) automatically create daily links             :elisp:shell:
** CODE (18/11/12) check the links automatically                      :shell:
** CHECK (18/11/17) check git merge                                     :git:
** CHECK (18/11/14) tag insertion right and left of selection         :emacs:
** CHECK (18/11/14) FireFox/Safari/Chrome developer tools           :browser:
** CHECK (18/11/14) elfeed manual                                     :emacs:
** CHECK (18/11/14) isearch manual                                    :emacs:
** CHECK (18/11/13) "project" manager for all the files               :emacs:
** CHECK (18/11/11) add autocompletion for html/css                   :emacs:
** DONE (19/11/29) link this todo file to all the daily files    :elisp:html:
   - State "DONE"       from "TODO"       [2019-12-01 Sun 08:44]
Just added a link into the elisp template.
** DONE (18/11/14) pushing to github from emacs                       :emacs:
   - State "DONE"       from "TODO"       [2019-12-01 Sun 08:44]
Using magit is not that hard.

* administrative stuff
** DONE make a check list of all the tasks required in publishing the pages
   - State "DONE"       from "TODO"       [2019-11-28 Thu 22:35]
** DONE create a todo file
   - State "DONE"       from "TODO"       [2019-11-28 Thu 22:28]
** DONE gather all the todos written in older pages
   - State "DONE"       from "TODO"       [2019-11-29 Fri 18:28]
** DONE check how to customize org export because the HTML is ugly
   - State "DONE"       from "TODO"       [2019-12-01 Sun 08:42]
   What I don't like is how the headings are HTML headers. The ToC alone would be sufficient for what I need. I did some css and it looks much better. With lots of room for improvement.
