adventuresintechland.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-01 Sun 10:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My adventures in tech land - TODO file</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jean-Christophe Helary" />
<link rel="stylesheet" type="text/css" href="./adventuresintechland.org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=".."> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">My adventures in tech land - TODO file</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org272eb00"><span class="todo TODO">TODO</span> daily entries</a>
<ul>
<li><a href="#orgf874c40">create the folder for that day&#xa0;&#xa0;&#xa0;<span class="tag"><span class="finder">finder</span></span></a></li>
<li><a href="#org82b5a95">run <code>adventuresintechland_old.el</code> (for now) to create the template&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
<li><a href="#org111672f">fill the template with the stuff I did&#xa0;&#xa0;&#xa0;<span class="tag"><span class="me">me</span></span></a></li>
<li><a href="#org6eacc97">edit the main index:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="me">me</span></span></a>
<ul>
<li><a href="#org77e047a">[last day] x 2</a></li>
<li><a href="#org7c77eb7">logbook + nb of documented days</a></li>
</ul>
</li>
<li><a href="#orgad9b50a">create the rss entry in adventuresintechland.xml&#xa0;&#xa0;&#xa0;<span class="tag"><span class="me">me</span></span></a></li>
<li><a href="#org644a0ea">commit everything&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span></span></a>
<ul>
<li><a href="#org63a1999">git checkout "gh-pages"</a></li>
<li><a href="#org06d53b0">git status</a></li>
<li><a href="#org4dd9221">git add *</a></li>
<li><a href="#orgad54526">git commit -m "commit message"</a></li>
<li><a href="#org7a0e1ec">git push origin</a></li>
<li><a href="#orgada4c13">git checkout "master"</a></li>
<li><a href="#orgd8577fe">git merge gh-pages</a></li>
<li><a href="#org4b4f77d">git push origin</a></li>
<li><a href="#org8a5b383">git checkout "gh-pages"</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5aa16ea">code</a>
<ul>
<li><a href="#org1dee8d6"><span class="todo FIX">FIX</span> (19/12/01) just got bitten by the date edge cases&#x2026;&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span></span></a></li>
<li><a href="#org49e93fb"><span class="todo FIX">FIX</span> (19/11/29) the RSS feed does not work anymore&#xa0;&#xa0;&#xa0;<span class="tag"><span class="xml">xml</span></span></a></li>
<li><a href="#org8d0d429"><span class="todo CODE">CODE</span> (19/11/26) create daily folder structure and html template&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span></span></a></li>
<li><a href="#org8b298ce"><span class="todo CODE">CODE</span> (18/11/18) automated index creation for readings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="shell">shell</span></span></a></li>
<li><a href="#orga754e69"><span class="todo CODE">CODE</span> (18/11/18) Automate CSS index generation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="shell">shell</span></span></a></li>
<li><a href="#org92bb62b"><span class="todo CODE">CODE</span> (18/11/13) automatically create daily links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span>&#xa0;<span class="shell">shell</span></span></a></li>
<li><a href="#org2f36042"><span class="todo CODE">CODE</span> (18/11/12) check the links automatically&#xa0;&#xa0;&#xa0;<span class="tag"><span class="shell">shell</span></span></a></li>
<li><a href="#orgc94cb75"><span class="todo CHECK">CHECK</span> (18/11/17) check git merge&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span></span></a></li>
<li><a href="#orgce54cd9"><span class="todo CHECK">CHECK</span> (18/11/14) tag insertion right and left of selection&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
<li><a href="#orge4aaf7b"><span class="todo CHECK">CHECK</span> (18/11/14) FireFox/Safari/Chrome developer tools&#xa0;&#xa0;&#xa0;<span class="tag"><span class="browser">browser</span></span></a></li>
<li><a href="#org19891c6"><span class="todo CHECK">CHECK</span> (18/11/14) elfeed manual&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
<li><a href="#org00d499e"><span class="todo CHECK">CHECK</span> (18/11/14) isearch manual&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
<li><a href="#org917510d"><span class="todo CHECK">CHECK</span> (18/11/13) "project" manager for all the files&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
<li><a href="#org8e09517"><span class="todo CHECK">CHECK</span> (18/11/11) add autocompletion for html/css&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
<li><a href="#org5c942b1"><span class="done DONE">DONE</span> (19/11/29) link this todo file to all the daily files&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span>&#xa0;<span class="html">html</span></span></a></li>
<li><a href="#org65f6d8e"><span class="done DONE">DONE</span> (18/11/14) pushing to github from emacs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
</ul>
</li>
<li><a href="#orgace7ae2">administrative stuff</a>
<ul>
<li><a href="#org68abf73"><span class="done DONE">DONE</span> make a check list of all the tasks required in publishing the pages</a></li>
<li><a href="#org68ab468"><span class="done DONE">DONE</span> create a todo file</a></li>
<li><a href="#org5756625"><span class="done DONE">DONE</span> gather all the todos written in older pages</a></li>
<li><a href="#org60650a1"><span class="done DONE">DONE</span> check how to customize org export because the HTML is ugly</a></li>
</ul>
</li>
</ul>
</div>
</div>
<hr />
<div id="outline-container-org272eb00" class="outline-2">
<h2 id="org272eb00"><span class="todo TODO">TODO</span> daily entries</h2>
<div class="outline-text-2" id="text-org272eb00">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-11-29 Fri 20:26]</span></span></li>
</ul>
</div>
<div id="outline-container-orgf874c40" class="outline-3">
<h3 id="orgf874c40">create the folder for that day&#xa0;&#xa0;&#xa0;<span class="tag"><span class="finder">finder</span></span></h3>
</div>
<div id="outline-container-org82b5a95" class="outline-3">
<h3 id="org82b5a95">run <code>adventuresintechland_old.el</code> (for now) to create the template&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
</div>
<div id="outline-container-org111672f" class="outline-3">
<h3 id="org111672f">fill the template with the stuff I did&#xa0;&#xa0;&#xa0;<span class="tag"><span class="me">me</span></span></h3>
</div>
<div id="outline-container-org6eacc97" class="outline-3">
<h3 id="org6eacc97">edit the main index:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="me">me</span></span></h3>
<div class="outline-text-3" id="text-org6eacc97">
</div>
<div id="outline-container-org77e047a" class="outline-4">
<h4 id="org77e047a">[last day] x 2</h4>
</div>
<div id="outline-container-org7c77eb7" class="outline-4">
<h4 id="org7c77eb7">logbook + nb of documented days</h4>
</div>
</div>
<div id="outline-container-orgad9b50a" class="outline-3">
<h3 id="orgad9b50a">create the rss entry in adventuresintechland.xml&#xa0;&#xa0;&#xa0;<span class="tag"><span class="me">me</span></span></h3>
</div>
<div id="outline-container-org644a0ea" class="outline-3">
<h3 id="org644a0ea">commit everything&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span></span></h3>
<div class="outline-text-3" id="text-org644a0ea">
</div>
<div id="outline-container-org63a1999" class="outline-4">
<h4 id="org63a1999">git checkout "gh-pages"</h4>
</div>
<div id="outline-container-org06d53b0" class="outline-4">
<h4 id="org06d53b0">git status</h4>
</div>
<div id="outline-container-org4dd9221" class="outline-4">
<h4 id="org4dd9221">git add *</h4>
</div>
<div id="outline-container-orgad54526" class="outline-4">
<h4 id="orgad54526">git commit -m "commit message"</h4>
</div>
<div id="outline-container-org7a0e1ec" class="outline-4">
<h4 id="org7a0e1ec">git push origin</h4>
</div>
<div id="outline-container-orgada4c13" class="outline-4">
<h4 id="orgada4c13">git checkout "master"</h4>
</div>
<div id="outline-container-orgd8577fe" class="outline-4">
<h4 id="orgd8577fe">git merge gh-pages</h4>
</div>
<div id="outline-container-org4b4f77d" class="outline-4">
<h4 id="org4b4f77d">git push origin</h4>
</div>
<div id="outline-container-org8a5b383" class="outline-4">
<h4 id="org8a5b383">git checkout "gh-pages"</h4>
</div>
</div>
</div>

<div id="outline-container-org5aa16ea" class="outline-2">
<h2 id="org5aa16ea">code</h2>
<div class="outline-text-2" id="text-org5aa16ea">
</div>
<div id="outline-container-org1dee8d6" class="outline-3">
<h3 id="org1dee8d6"><span class="todo FIX">FIX</span> (19/12/01) just got bitten by the date edge cases&#x2026;&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span></span></h3>
</div>
<div id="outline-container-org49e93fb" class="outline-3">
<h3 id="org49e93fb"><span class="todo FIX">FIX</span> (19/11/29) the RSS feed does not work anymore&#xa0;&#xa0;&#xa0;<span class="tag"><span class="xml">xml</span></span></h3>
</div>
<div id="outline-container-org8d0d429" class="outline-3">
<h3 id="org8d0d429"><span class="todo CODE">CODE</span> (19/11/26) create daily folder structure and html template&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span></span></h3>
</div>
<div id="outline-container-org8b298ce" class="outline-3">
<h3 id="org8b298ce"><span class="todo CODE">CODE</span> (18/11/18) automated index creation for readings&#xa0;&#xa0;&#xa0;<span class="tag"><span class="shell">shell</span></span></h3>
</div>
<div id="outline-container-orga754e69" class="outline-3">
<h3 id="orga754e69"><span class="todo CODE">CODE</span> (18/11/18) Automate CSS index generation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="shell">shell</span></span></h3>
<div class="outline-text-3" id="text-orga754e69">
<p>
The index.sh script exists but needs to be run automatically.
</p>
</div>
</div>
<div id="outline-container-org92bb62b" class="outline-3">
<h3 id="org92bb62b"><span class="todo CODE">CODE</span> (18/11/13) automatically create daily links&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span>&#xa0;<span class="shell">shell</span></span></h3>
</div>
<div id="outline-container-org2f36042" class="outline-3">
<h3 id="org2f36042"><span class="todo CODE">CODE</span> (18/11/12) check the links automatically&#xa0;&#xa0;&#xa0;<span class="tag"><span class="shell">shell</span></span></h3>
</div>
<div id="outline-container-orgc94cb75" class="outline-3">
<h3 id="orgc94cb75"><span class="todo CHECK">CHECK</span> (18/11/17) check git merge&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span></span></h3>
</div>
<div id="outline-container-orgce54cd9" class="outline-3">
<h3 id="orgce54cd9"><span class="todo CHECK">CHECK</span> (18/11/14) tag insertion right and left of selection&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
</div>
<div id="outline-container-orge4aaf7b" class="outline-3">
<h3 id="orge4aaf7b"><span class="todo CHECK">CHECK</span> (18/11/14) FireFox/Safari/Chrome developer tools&#xa0;&#xa0;&#xa0;<span class="tag"><span class="browser">browser</span></span></h3>
</div>
<div id="outline-container-org19891c6" class="outline-3">
<h3 id="org19891c6"><span class="todo CHECK">CHECK</span> (18/11/14) elfeed manual&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
</div>
<div id="outline-container-org00d499e" class="outline-3">
<h3 id="org00d499e"><span class="todo CHECK">CHECK</span> (18/11/14) isearch manual&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
</div>
<div id="outline-container-org917510d" class="outline-3">
<h3 id="org917510d"><span class="todo CHECK">CHECK</span> (18/11/13) "project" manager for all the files&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
</div>
<div id="outline-container-org8e09517" class="outline-3">
<h3 id="org8e09517"><span class="todo CHECK">CHECK</span> (18/11/11) add autocompletion for html/css&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
</div>
<div id="outline-container-org5c942b1" class="outline-3">
<h3 id="org5c942b1"><span class="done DONE">DONE</span> (19/11/29) link this todo file to all the daily files&#xa0;&#xa0;&#xa0;<span class="tag"><span class="elisp">elisp</span>&#xa0;<span class="html">html</span></span></h3>
<div class="outline-text-3" id="text-org5c942b1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-12-01 Sun 08:44]</span></span></li>
</ul>
<p>
Just added a link into the elisp template.
</p>
</div>
</div>
<div id="outline-container-org65f6d8e" class="outline-3">
<h3 id="org65f6d8e"><span class="done DONE">DONE</span> (18/11/14) pushing to github from emacs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
<div class="outline-text-3" id="text-org65f6d8e">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-12-01 Sun 08:44]</span></span></li>
</ul>
<p>
Using magit is not that hard.
</p>
</div>
</div>
</div>

<div id="outline-container-orgace7ae2" class="outline-2">
<h2 id="orgace7ae2">administrative stuff</h2>
<div class="outline-text-2" id="text-orgace7ae2">
</div>
<div id="outline-container-org68abf73" class="outline-3">
<h3 id="org68abf73"><span class="done DONE">DONE</span> make a check list of all the tasks required in publishing the pages</h3>
<div class="outline-text-3" id="text-org68abf73">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-11-28 Thu 22:35]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org68ab468" class="outline-3">
<h3 id="org68ab468"><span class="done DONE">DONE</span> create a todo file</h3>
<div class="outline-text-3" id="text-org68ab468">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-11-28 Thu 22:28]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org5756625" class="outline-3">
<h3 id="org5756625"><span class="done DONE">DONE</span> gather all the todos written in older pages</h3>
<div class="outline-text-3" id="text-org5756625">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-11-29 Fri 18:28]</span></span></li>
</ul>
</div>
</div>
<div id="outline-container-org60650a1" class="outline-3">
<h3 id="org60650a1"><span class="done DONE">DONE</span> check how to customize org export because the HTML is ugly</h3>
<div class="outline-text-3" id="text-org60650a1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2019-12-01 Sun 08:42]</span></span></li>
</ul>
<p>
What I don't like is how the headings are HTML headers. The ToC alone would be sufficient for what I need. I did some css and it looks much better. With lots of room for improvement.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jean-Christophe Helary</p>
<p class="date">Created: 2019-12-01 Sun 10:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
